# 데이터 조회

In [ ]:
# 1.Quiz.csv 파일 불러온 후 표현하기

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../data_set/1.pandas/1.Quiz.csv")

In [3]:
df

   경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
0   39060    7313    3627     309     300     B
1   39896    6967    4168    1771     350     B
2   42005    6873    4088    1954     450     A
3   43621    6626    4424    2244     560     A
4   41702    8675    4606    3146    1300     A
5   41266   10622    4984    3945    2395     A
6   32427    9228    5570    5766    3786     C

In [ ]:
# index 설정

In [4]:
index_name = ['2011','2012','2013','2014','2015','2016','2017']
df.index = index_name

In [5]:
df

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A
2017   32427    9228    5570    5766    3786     C

# 컬럼 조회

In [ ]:
# 컬럼들만 추출

In [6]:
df.columns

Index(['경부선KTX', '호남선KTX', '경전선KTX', '전라선KTX', '동해선KTX', '경부선등급'], dtype='object')

In [ ]:
# 경부선KTX 열만 조회

In [39]:
df['경부선KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

In [8]:
df.loc[ : , '경부선KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선KTX, dtype: int64

In [ ]:
# 경부선KTX, 호남선KTX 컬럼 조회

In [40]:
df[['경부선KTX','호남선KTX']]

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

In [9]:
df.loc[ : , ['경부선KTX', '호남선KTX']]

      경부선KTX  호남선KTX
2011   39060    7313
2012   39896    6967
2013   42005    6873
2014   43621    6626
2015   41702    8675
2016   41266   10622
2017   32427    9228

In [10]:
# 인덱싱 사용(loc 사용 아님) 행 기준 조회, 2012~2015년도
# 인덱스 번호를 이용하세요

In [12]:
df[1:5]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

In [ ]:
# 행 기준 조회, 2012~2015년도
# 해당 인덱스의 이름으로 조회하세요

In [13]:
df['2012':'2015']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

In [14]:
df['2012':'2015'][['경부선KTX', '호남선KTX', '경전선KTX','전라선KTX','동해선KTX','경부선등급']]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2012   39896    6967    4168    1771     350     B
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A

# loc를 이용한 조회

In [ ]:
# loc 사용, 컬럼이 '경부선KTX'의 모든 행

In [15]:
df.loc[ : , ['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2013   42005
2014   43621
2015   41702
2016   41266
2017   32427

In [ ]:
# 2011년 데이터만 선택, loc 사용

In [22]:
df.loc[['2011']]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B

In [ ]:
# 2013~2016년 행 데이터 선택, loc 사용

In [25]:
df.loc['2013':'2016']

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2013   42005    6873    4088    1954     450     A
2014   43621    6626    4424    2244     560     A
2015   41702    8675    4606    3146    1300     A
2016   41266   10622    4984    3945    2395     A

In [ ]:
# 2012~2014년까지 경부선KTX 컬럼만 조회. loc 사용

In [26]:
df.loc['2012':'2014', ['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [ ]:
# loc 사용 안 함

In [29]:
df[1:4][['경부선KTX']]

      경부선KTX
2012   39896
2013   42005
2014   43621

In [ ]:
# 2015~2017년까지 경부선KTX, 호남선KTX, 동해선KTX 컬럼 조회

In [30]:
df.loc['2015':'2017', ['경부선KTX', '호남선KTX','동해선KTX']]

      경부선KTX  호남선KTX  동해선KTX
2015   41702    8675    1300
2016   41266   10622    2395
2017   32427    9228    3786

In [ ]:
# isin 사용
# 경부선 등급이 'B', 'C'인 데이터 조회

In [41]:
df.loc[df['경부선등급'].isin(['B', 'C'])]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

In [34]:
df[df['경부선등급'].isin(['B', 'C'])]

      경부선KTX  호남선KTX  경전선KTX  전라선KTX  동해선KTX 경부선등급
2011   39060    7313    3627     309     300     B
2012   39896    6967    4168    1771     350     B
2017   32427    9228    5570    5766    3786     C

In [ ]:
# 위 조건을 만족하는 경부선KTX만 조회

In [38]:
df.loc[df['경부선등급'].isin(['B', 'C']), ['경부선KTX']]

      경부선KTX
2011   39060
2012   39896
2017   32427